<template>
  <div id="cart">
    <scroll ref="scrollcart" class="content">
      <ul>
        <li>这是要展示的数据1</li>
        <li>这是要展示的数据2</li>
        <li>这是要展示的数据3</li>
        <li>这是要展示的数据4</li>
        <li>这是要展示的数据5</li>
        <li>这是要展示的数据6</li>
        <li>这是要展示的数据7</li>
        <li>这是要展示的数据8</li>
        <li>这是要展示的数据9</li>
        <li>这是要展示的数据10</li>
        <li>这是要展示的数据11</li>
        <li>这是要展示的数据12</li>
        <li>这是要展示的数据13</li>
        <li>这是要展示的数据14</li>
        <li>这是要展示的数据15</li>
        <li>这是要展示的数据16</li>
        <li>这是要展示的数据17</li>
        <li>这是要展示的数据18</li>
        <li>这是要展示的数据19</li>
        <li>这是要展示的数据20</li>
        <li>这是要展示的数据21</li>
        <li>这是要展示的数据22</li>
        <li>这是要展示的数据23</li>
        <li>这是要展示的数据24</li>
        <li>这是要展示的数据25</li>
        <li>这是要展示的数据26</li>
        <li>这是要展示的数据27</li>
        <li>这是要展示的数据28</li>
        <li>这是要展示的数据29</li>
        <li>这是要展示的数据30</li>
        <li>这是要展示的数据31</li>
        <li>这是要展示的数据32</li>
        <li>这是要展示的数据33</li>
        <li>这是要展示的数据34</li>
        <li>这是要展示的数据35</li>
        <li>这是要展示的数据36</li>
        <li>这是要展示的数据37</li>
        <li>这是要展示的数据38</li>
        <li>这是要展示的数据39</li>
        <li>这是要展示的数据40</li>
        <li>这是要展示的数据41</li>
        <li>这是要展示的数据42</li>
        <li>这是要展示的数据43</li>
        <li>这是要展示的数据44</li>
        <li>这是要展示的数据45</li>
        <li>这是要展示的数据46</li>
        <li>这是要展示的数据47</li>
        <li>这是要展示的数据48</li>
        <li>这是要展示的数据49</li>
        <li>这是要展示的数据50</li>
        <li>这是要展示的数据51</li>
        <li>这是要展示的数据52</li>
        <li>这是要展示的数据53</li>
        <li>这是要展示的数据54</li>
        <li>这是要展示的数据55</li>
        <li>这是要展示的数据56</li>
        <li>这是要展示的数据57</li>
        <li>这是要展示的数据58</li>
        <li>这是要展示的数据59</li>
        <li>这是要展示的数据60</li>
        <li>这是要展示的数据61</li>
        <li>这是要展示的数据62</li>
        <li>这是要展示的数据63</li>
        <li>这是要展示的数据64</li>
        <li>这是要展示的数据65</li>
        <li>这是要展示的数据66</li>
        <li>这是要展示的数据67</li>
        <li>这是要展示的数据68</li>
        <li>这是要展示的数据69</li>
        <li>这是要展示的数据70</li>
        <li>这是要展示的数据71</li>
        <li>这是要展示的数据72</li>
        <li>这是要展示的数据73</li>
        <li>这是要展示的数据74</li>
        <li>这是要展示的数据75</li>
        <li>这是要展示的数据76</li>
        <li>这是要展示的数据77</li>
        <li>这是要展示的数据78</li>
        <li>这是要展示的数据79</li>
        <li>这是要展示的数据80</li>
        <li>这是要展示的数据81</li>
        <li>这是要展示的数据82</li>
        <li>这是要展示的数据83</li>
        <li>这是要展示的数据84</li>
        <li>这是要展示的数据85</li>
        <li>这是要展示的数据86</li>
        <li>这是要展示的数据87</li>
        <li>这是要展示的数据88</li>
        <li>这是要展示的数据89</li>
        <li>这是要展示的数据90</li>
        <li>这是要展示的数据91</li>
        <li>这是要展示的数据92</li>
        <li>这是要展示的数据93</li>
        <li>这是要展示的数据94</li>
        <li>这是要展示的数据95</li>
        <li>这是要展示的数据96</li>
        <li>这是要展示的数据97</li>
        <li>这是要展示的数据98</li>
        <li>这是要展示的数据99</li>
        <li>这是要展示的数据100</li>
      </ul>
    </scroll>
  </div>
</template>

<script>
import Scroll from "@/components/common/scroll/Scroll";

export default {
name: "Cart",
  components:{
    Scroll,
  },

}
</script>

<style scoped>
.content{
  height: 600px;
  background: red;
  overflow: hidden;
}
</style>
